Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: This command generates a Maven structure importing the RESTEasy Reactive/JAX-RS, Jackson, and the Elasticsearch low level client extensions. After this, the `quarkus-elasticsearch-rest-client` extension has been added to your build file.
ja_jp: このコマンドは、RESTEasy/JAX-RS、Jackson、およびElasticsearchの低レベルクライアント拡張をインポートするMaven構造を生成します。この後、 `quarkus-elasticsearch-rest-client` のエクステンションがビルドファイルに追加されています。

source: This command generates a Maven structure importing the RESTEasy Reactive/Jakarta REST, Jackson and Hibernate Validator/Bean Validation extensions.
ja_jp: このコマンドは、RESTEasy Reactive/Jakarta REST、Jackson、Hibernate Validator/Bean ValidationエクステンションをインポートするMaven構造を生成します。

source: This command generates a Maven structure importing the RESTEasy/JAX-RS, Jackson and Hibernate Validator/Bean Validation extensions.
ja_jp: このコマンドは、RESTEasy/JAX-RS、Jackson、およびHibernate Validator/Bean ValidationエクステンションをインポートするMavenディレクトリー構造を生成します。

source: This command generates a Maven structure importing the RESTEasy/JAX-RS, Jackson, and the Elasticsearch low level client extensions. After this, the `quarkus-elasticsearch-rest-client` extension has been added to your build file.
ja_jp: このコマンドは、RESTEasy/JAX-RS、Jackson、および Elasticsearch 低レベルクライアント拡張をインポートする Maven 構造を生成します。 この後、 `quarkus-elasticsearch-rest-client` エクステンションがビルドファイルに追加されます。

source: This command generates a Maven structure importing the following extensions:
ja_jp: このコマンドは、以下のエクステンションをインポートするMaven構造体を生成します:

source: This command generates a Maven structure including the following extensions:
ja_jp: このコマンドは、以下のエクステンションを含むMaven構造を生成します：

source: This command generates a Quarkus project that uses the `smallrye-metrics` extension.
ja_jp: このコマンドは、 `smallrye-metrics` エクステンションを使用するMavenベースのQuarkusプロジェクトを生成します。

source: This command generates a certificate signed by the Quarkus Development CA, which your system will trust if properly installed or imported.
ja_jp: このコマンドは、Quarkus 開発用 CA によって署名された証明書を生成します。開発用 CA は、適切にインストールまたはインポートされた場合にシステムによって信頼されます。

source: This command generates a new project importing the Quarkus REST (formerly RESTEasy Reactive), REST client, and https://github.com/FasterXML/jackson[Jackson] extensions, and in particular, adds the following dependencies:
ja_jp: このコマンドは、Quarkus REST（旧RESTEasy Reactive）、RESTクライアント、 link:https://github.com/FasterXML/jackson[Jackson] エクステンションをインポートする新しいプロジェクトを生成し、特に以下の依存関係を追加します：

source: This command generates a new project importing the Quarkus REST/Jakarta REST and https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] extensions, and in particular adds the following dependency:
ja_jp: このコマンドは、Quarkus REST/Jakarta RESTおよび link:https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] エクステンションをインポートする新しいプロジェクトを生成し、 特に以下の依存関係を追加します：

source: This command generates a new project importing the Quarkus REST/Jakarta REST and https://github.com/FasterXML/jackson[Jackson] extensions, and in particular adds the following dependency:
ja_jp: このコマンドは、Quarkus REST/Jakarta RESTおよび link:https://github.com/FasterXML/jackson[Jackson] エクステンションをインポートする新しいプロジェクトを生成し、 特に以下の依存関係を追加します：

source: This command generates a new project importing the RESTEasy Reactive, Reactive REST client, and https://github.com/FasterXML/jackson[Jackson] extensions, and in particular, adds the following dependencies:
ja_jp: このコマンドは、RESTEasy Reactive、Reactive REST client、および link:https://github.com/FasterXML/jackson[Jackson] エクステンションをインポートする新しいプロジェクトを生成し、特に以下の依存関係を追加します：

source: This command generates a new project importing the RESTEasy Reactive/JAX-RS and https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] extensions, and in particular adds the following dependency:
ja_jp: このコマンドは、RESTEasy/JAX-RSと https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] エクステンションをインポートする新しいプロジェクトを生成し、特に以下の依存関係を追加します:

source: This command generates a new project importing the RESTEasy Reactive/JAX-RS and https://github.com/FasterXML/jackson[Jackson] extensions, and in particular adds the following dependency:
ja_jp: このコマンドは、RESTEasy/JAX-RSと link:https://github.com/FasterXML/jackson[Jackson] エクステンションをインポートする新しいプロジェクトを生成し、特に以下の依存関係を追加します。

source: This command generates a new project importing the RESTEasy Reactive/Jakarta REST and https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] extensions, and in particular adds the following dependency:
ja_jp: このコマンドは、RESTEasy Reactive/Jakarta RESTおよび link:https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] エクステンションをインポートする新しいプロジェクトを生成し、特に次の依存関係を追加します:

source: This command generates a new project importing the RESTEasy Reactive/Jakarta REST and https://github.com/FasterXML/jackson[Jackson] extensions, and in particular adds the following dependency:
ja_jp: このコマンドは、RESTEasy Reactive/Jakarta RESTおよび link:https://github.com/FasterXML/jackson[Jackson] エクステンションをインポートする新しいプロジェクトを生成し、特に次の依存関係を追加します:

source: This command generates a new project importing the RESTEasy/JAX-RS and https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] extensions, and in particular adds the following dependency:
ja_jp: このコマンドは、 RESTEasy/JAX-RS および https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] エクステンションをインポートする新しいプロジェクトを生成し、特に次の依存関係を追加します。

source: This command generates a new project importing the RESTEasy/JAX-RS and https://github.com/FasterXML/jackson[Jackson] extensions, and in particular adds the following dependency:
ja_jp: このコマンドは、 RESTEasy/JAX-RS および https://github.com/FasterXML/jackson[Jackson] エクステンションをインポートする新しいプロジェクトを生成し、特に次の依存関係を追加します。

source: This command generates a new project importing the RESTEasy/Jakarta REST and https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] extensions, and in particular adds the following dependency:
ja_jp: このコマンドは、RESTEasy/Jakarta RESTおよび link:https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] エクステンションをインポートする新しいプロジェクトを生成し、特に次の依存関係を追加します：

source: This command generates a new project importing the RESTEasy/Jakarta REST and https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] extensions, and in particular, adds the following dependency:
ja_jp: このコマンドは、RESTEasy/Jakarta REST および https://eclipse-ee4j.github.io/jsonb-api/[JSON-B] エクステンションをインポートする新しいプロジェクトを生成し、特に次の依存関係を追加します。

source: This command generates a new project importing the RESTEasy/Jakarta REST and https://github.com/FasterXML/jackson[Jackson] extensions, and in particular adds the following dependency:
ja_jp: このコマンドは、RESTEasy/Jakarta RESTおよび link:https://github.com/FasterXML/jackson[Jackson] エクステンションをインポートする新しいプロジェクトを生成し、特に次の依存関係を追加します：

source: This command generates a new project importing the RESTEasy/Jakarta REST and https://github.com/FasterXML/jackson[Jackson] extensions, and in particular, adds the following dependency:
ja_jp: このコマンドは、RESTEasy/Jakarta REST および https://github.com/FasterXML/jackson[Jackson] エクステンションをインポートする新しいプロジェクトを生成し、特に次の依存関係を追加します。

source: This command generates a new project importing the quarkus-qpid-jms extension:
ja_jp: このコマンドは、quarkus-qpid-jmsエクステンションをインポートした新しいプロジェクトを生成します:

source: This command generates a new project with the `keycloak-authorization` extension. The extension integrates a Keycloak Adapter into your Quarkus application, providing the necessary capabilities to interact with a Keycloak server and perform bearer token authorization.
ja_jp: このコマンドは、 `keycloak-authorization` エクステンションを持つ新しいプロジェクトを生成します。 このエクステンションは、Keycloak アダプターを Quarkus アプリケーションに統合し、Keycloak サーバーと対話してベアラートークンの認可を実行するために必要な機能を提供します。

source: This command generates a new project, importing the Infinispan Client extension.
ja_jp: このコマンドは、Infinispan Clientエクステンションをインポートして、新しいプロジェクトを生成します。

source: This command generates a new project, importing the Redis extension.
ja_jp: このコマンドは、Redisエクステンションをインポートして新しいプロジェクトを生成します。

source: This command generates a new project, importing the `elytron-security-jdbc` extension which is an https://docs.wildfly.org/17/WildFly_Elytron_Security.html#jdbc-security-realm[`wildfly-elytron-realm-jdbc`] adapter for Quarkus applications.
ja_jp: このコマンドは新しいプロジェクトを生成し、 `elytron-security-jdbc` エクステンションをインポートします。これはQuarkusアプリケーション用の link:https://docs.wildfly.org/17/WildFly_Elytron_Security.html#jdbc-security-realm[`wildfly-elytron-realm-jdbc`] アダプターです。

source: This command generates a project and imports the `elytron-security-oauth2` extension, which includes the OAuth2 opaque token support.
ja_jp: このコマンドはプロジェクトを生成し、OAuth2のopaqueトークンのサポートを含む `elytron-security-oauth2` エクステンションをインポートします。

source: This command generates a project and imports the `spring-boot-properties` extension.
ja_jp: このコマンドは、プロジェクトを生成し、 `spring-boot-properties` エクステンションをインポートします。

source: This command generates a project structure importing the Quarkus Azure Functions HTTP extension. It includes an example.
ja_jp: このコマンドは、Quarkus Azure Functions HTTP エクステンションをインポートするプロジェクト構造を生成します。サンプルが含まれています。

source: This command generates a project which imports the `csrf-reactive` extension.
ja_jp: このコマンドは、 `csrf-reactive` エクステンションをインポートするプロジェクトを生成します。

source: This command generates a project which imports the `keycloak-admin-client-reactive` and `resteasy-reactive-jackson` extensions.
ja_jp: このコマンドは、 `keycloak-admin-client-reactive` と `resteasy-reactive-jackson` のエクステンションをインポートするプロジェクトを生成します。

source: This command generates a project which imports the `keycloak-admin-rest-client` and `rest-jackson` extensions.
ja_jp: このコマンドは、 `keycloak-admin-rest-client` と `rest-jackson` のエクステンションをインポートしたプロジェクトを生成します。

source: This command generates a project which imports the `rest-csrf` extension.
ja_jp: このコマンドは、 `rest-csrf` エクステンションをインポートするプロジェクトを生成します。

source: This command generates a project which imports the `spring-cache` and `spring-di` extensions.
ja_jp: このコマンドは、 `spring-cache` と `spring-di` のエクステンションをインポートするプロジェクトを生成します。

source: This command generates a project which imports the `spring-cloud-config-client` extension.
ja_jp: このコマンドは、 `spring-cloud-config-client` エクステンションをインポートするプロジェクトを生成します。

source: This command generates a project which imports the `spring-di` extension.
ja_jp: このコマンドは、プロジェクトを生成し、 `spring-di` エクステンションをインポートします。

source: This command generates a project which imports the `spring-web` extension.
ja_jp: このコマンドは、プロジェクトを生成し、 `spring-web` エクステンションをインポートします。

source: This command generates a project which imports the `spring-web`, `spring-security` and `security-properties-file` extensions.
ja_jp: このコマンドは、 `spring-web`、 `spring-security`、および `security-properties-file` エクステンションをインポートするプロジェクトを生成します。

source: This command generates a project with the `spring-data-rest` extension.
ja_jp: このコマンドは、 `spring-data-rest` のエクステンションを持つ Maven プロジェクトを生成します。

source: This command generates a project, importing the `elytron-security-ldap` extension which is a `wildfly-elytron-realm-ldap` adapter for Quarkus applications.
ja_jp: このコマンドはプロジェクトを生成し、Quarkusアプリケーションのための `wildfly-elytron-realm-ldap`アダプターである `elytron-security-ldap`拡張をインポートします。

source: This command generates a project, importing the `keycloak-authorization` extension which is an implementation of a Keycloak Adapter for Quarkus applications and provides all the necessary capabilities to integrate with a Keycloak Server and perform bearer token authorization.
ja_jp: このコマンドはプロジェクトを生成し、 `keycloak-authorization` エクステンションをインポートします。これはQuarkusアプリケーション用のKeycloakアダプターの実装で、Keycloakサーバーと統合してベアラートークンの認可を実行するのに必要なすべての機能を提供します。

source: This command generates a project, importing the `smallrye-graphql-client` extension, and also the `rest-jsonb` extension, because we will use that too - a REST endpoint will be the entrypoint to allow you to manually trigger the GraphQL client to do its work.
ja_jp: このコマンドはプロジェクトを生成し、 `smallrye-graphql-client` エクステンションをインポートし、 `rest-jsonb` エクステンションも使用します。

source: This command generates a project, importing the `smallrye-graphql-client` extension, and also the `resteasy-reactive` extension, because we will use that too - a REST endpoint will be the entrypoint to allow you to manually trigger the GraphQL client to do its work.
ja_jp: このコマンドはプロジェクトを生成し、 `smallrye-graphql-client` エクステンションと `resteasy-reactive` エクステンションもインポートします。これらも使用するためです。REST エンドポイントは、GraphQL クライアントを実行する為に、手動でトリガーできるようにするエントリポイントになります。

source: This command generates a project, importing the `smallrye-graphql` extension.
ja_jp: このコマンドは、 `smallrye-graphql` エクステンションをインポートした Maven プロジェクトを生成します。

source: This command generates a project, importing the `smallrye-health` extension.
ja_jp: このコマンドは、 `smallrye-health` エクステンションをインポートしたプロジェクトを生成します。

source: This command generates a project, importing the extensions for Quarkus REST (formerly RESTEasy Reactive)/Jakarta REST and SmallRye Fault Tolerance.
ja_jp: このコマンドはプロジェクトを生成し、Quarkus REST（旧RESTEasy Reactive）/Jakarta RESTおよびSmallRye Fault Toleranceのエクステンションをインポートします。

source: This command generates a project, importing the extensions for RESTEasy Reactive/JAX-RS and SmallRye Fault Tolerance.
ja_jp: このコマンドは、RESTEasy Reactive/JAX-RSおよびSmallRye Fault Toleranceのエクステンションをインポートして、プロジェクトを生成します。

source: This command generates a project, importing the extensions for RESTEasy Reactive/Jakarta REST and SmallRye Fault Tolerance.
ja_jp: このコマンドは、プロジェクトを生成して、RESTEasy Reactive/Jakarta RESTとSmallRye Fault Toleranceのエクステンションをインポートします。

source: This command generates a project, importing the extensions for RESTEasy/JAX-RS and SmallRye Fault Tolerance.
ja_jp: このコマンドは、RESTEasy/JAX-RSとSmallRye Fault Toleranceのエクステンションをインポートして、プロジェクトを生成します。

source: This command generates the Maven project and imports the Quarkus JFR extension, which includes the default JFR support.
ja_jp: このコマンドは Maven プロジェクトを生成し、Quarkus JFR エクステンションをインポートします。 これには、デフォルトの JFR サポートが含まれます。

source: This command generates the Maven project and imports the `quarkus-opentelemetry-exporter-otlp` extension, which includes the OpenTelemetry support, and a gRPC span exporter for https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/protocol/otlp.md[OTLP].
ja_jp: このコマンドは、RESTエンドポイントを持つMavenプロジェクトを生成し、OpenTelemetryのサポートを含む `quarkus-opentelemetry-exporter-otlp` エクステンションと、 link:https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/protocol/otlp.md[OTLP]用のgRPCスパンエクスポーターをインポートします。

source: This command generates the Maven project and imports the `quarkus-opentelemetry` extension, which includes the default OpenTelemetry support, and a gRPC span exporter for https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/protocol/otlp.md[OTLP].
ja_jp: このコマンドはMavenプロジェクトを生成し、 `quarkus-opentelemetry` エクステンションをインポートします。このエクステンションには、デフォルトのOpenTelemetryサポートと、 https://github.com/open-telemetry/opentelemetry-specification/blob/main/specification/protocol/otlp.md[OTLP]のgRPC spanエクスポーターが含まれています。

source: This command generates the Maven project and imports the `smallrye-jwt` extension, which includes the {mp-jwt} support.
ja_jp: このコマンドは、RESTエンドポイントを持つMavenプロジェクトを生成し、{mp-jwt} サポートを含む `smallrye-jwt` エクステンションをインポートします。

source: This command generates the Maven project and imports the `smallrye-opentracing` extension, which includes the OpenTracing support and the default https://www.jaegertracing.io/[Jaeger] tracer.
ja_jp: このコマンドはMaven プロジェクトを生成し、OpenTracingのサポートとデフォルトの link:https://www.jaegertracing.io/[Jaeger] トレーサーを含む `smallrye-opentracing` エクステンションをインポートします。

source: This command generates the Maven project with a REST endpoint and imports the `rest-client` and `resteasy` extensions. It also adds the `resteasy-multipart` extension to support `multipart/form-data` requests.
ja_jp: このコマンドは、RESTエンドポイントを持つMavenプロジェクトを生成し、 `rest-client` と `resteasy` のエクステンションをインポートします。また、 `multipart/form-data` のリクエストをサポートするために `resteasy-multipart` のエクステンションを追加します。

source: This command generates the Maven project with a REST endpoint and imports:
ja_jp: このコマンドは、REST エンドポイントを持つ Maven プロジェクトを生成し、 `rest-client` と `resteasy-jackson` のエクステンションをインポートします。

source: This command generates the Maven structure importing the `smallrye-opentracing` extension, which includes the OpenTracing support and the default https://www.jaegertracing.io/[Jaeger] tracer.
ja_jp: このコマンドは Maven プロジェクトを生成し、OpenTracing のサポートとデフォルトの https://www.jaegertracing.io/[Jaeger] トレーサーを含む `smallrye-opentracing` エクステンションをインポートします。

source: This command generates the project (without any classes) and imports the `websockets-next` extension.
ja_jp: このコマンドは、プロジェクト (クラスなし) を生成し、`websockets-next` エクステンションをインポートします。

source: This command generates the project (without any classes) and imports the `websockets` extension.
ja_jp: このコマンドは、Mavenプロジェクト(クラスなし)を生成し、 `websockets` エクステンションをインポートします。

source: This command generates the project and imports the `cache` and `rest-jackson` extensions.
ja_jp: このコマンドはプロジェクトを生成し、 `cache` と `rest-jackson` エクステンションモジュールをインポートします。

source: This command generates the project and imports the `cache` and `resteasy-jackson` extensions.
ja_jp: このコマンドは、プロジェクトを生成し、 `cache` と `resteasy-jackson` のエクステンションをインポートします。

source: This command generates the project and imports the `cache` and `resteasy-reactive-jackson` extensions.
ja_jp: このコマンドは、プロジェクトを生成し、 `cache` と `resteasy-reactive-jackson` のエクステンションをインポートします。

source: This command initializes the file structure and the minimum set of required files in the project:
ja_jp: このコマンドは、プロジェクトのファイル構造と最低限必要なファイルのセットを初期化します。

source: This command outputs a message similar to the following example:
ja_jp: このコマンドは、次の例のようなメッセージを出力します。

source: This command returns the `200` status code and the name `alice`.
ja_jp: このコマンドは、ステータスコード `200` と名前 `alice` を返します。

source: This command returns the following response:
ja_jp: このコマンドは次の応答を返します。

source: This command will build your application locally, then trigger a container image build and finally apply the generated OpenShift resources automatically. The generated resources use OpenShift's `DeploymentConfig` that is configured to automatically trigger a redeployment when a change in the `ImageStream` is noticed. In other words, any container image build after the initial deployment will automatically trigger redeployment, without the need to delete, update or re-apply the generated resources.
ja_jp: このコマンドは、アプリケーションをローカルでビルドし、次にコンテナイメージのビルドをトリガーし、最後に生成されたOpenShiftリソースを自動的に適用します。生成されたリソースは OpenShift の `DeploymentConfig` を使用しており、 `ImageStream` に変更があった場合には自動的に再デプロイメントが行われるように設定されています。つまり、最初のデプロイメントの後は、コンテナイメージをビルドすると、自動的に再デプロイメントが開始されるため、生成されたリソースを削除、更新、再適用する必要がありません。

source: This command will build your application locally, then trigger a container image build and finally apply the generated OpenShift resources automatically. The generated resources use a Kubernetes `Deployment`, but still make use of OpenShift specific resources like `Route`, `BuildConfig` etc.
ja_jp: このコマンドはアプリケーションをローカルでビルドし、コンテナイメージのビルドをトリガーし、最後に生成された OpenShift リソースを自動的に適用します。 生成されたリソースは Kubernetes `Deployment` を使用しますが、 `Route` や `BuildConfig` などの OpenShift 固有のリソースを使用します。

source: This command will create a new REST application in the `getting-started-with-heroku` directory.
ja_jp: このコマンドは、`getting-started-with-heroku` ディレクトリーに新しい REST アプリケーションを作成します。

source: This command will generate all the files and configuration needed for the native image build in `target/{project.name}-{project.version}-runner.nib`.
ja_jp: このコマンドにより、ネイティブイメージのビルドに必要なすべてのファイルと設定が `target/{project.name}-{project.version}-runner.nib` に生成されます。

source: This command will give you as output a `httpsTrigger.url` that points to your function.
ja_jp: このコマンドは、作成したCloud Functions 関数をトリガーするための `httpsTrigger.url` を出力します。

source: This command will give you as output a `url` that points to your function.
ja_jp: このコマンドは、あなたの関数を指す `url` を出力として提供します。

source: This command will start a Redis instance to execute the tests.
ja_jp: このコマンドはテストを実行するためのRedisインスタンスを起動します。

source: This command will start a Redis instance to execute the tests. Thus your Redis containers need to be stopped.
ja_jp: このコマンドはテストを実行するためにRedisインスタンスを起動します。そのため、Redis コンテナーを停止する必要があります。

source: This command will start an Infinispan instance to execute the tests.
ja_jp: このコマンドは、テストを実行するためのInfinispanインスタンスを起動します。

source: This command will upload your application jar and launch it on App Engine.
ja_jp: このコマンドは、アプリケーション jar をアップロードし、App Engine で起動します。

source: This commitment to continuous innovation, driven by an active community, ensures that Apache Polaris is ready to become the industry standard for high-performance, secure, and multi-engine Iceberg catalog interoperability. We welcome contributors, users, and organizations to join us in defining this next era of the data ecosystem.
ja_jp: 活発なコミュニティーによって推進される継続的なイノベーションへのこのコミットメントは、Apache Polarisが高性能で安全な、マルチエンジンIcebergカタログ相互運用性の業界標準となる準備ができていることを保証します。私たちは、このデータエコシステムの次の時代を定義するために、貢献者、ユーザー、および組織が私たちに参加することを歓迎します。

source: This condition will apply to all methods defined in `MyDevModeProcessor`
ja_jp: この条件は `MyDevModeProcessor` で定義されたすべてのメソッドに適用されます。

source: This config tells it to ignore `@QuarkusTest` related classes, as they are loaded by `QuarkusClassLoader`
ja_jp: この設定は、 `QuarkusClassLoader` によってロードされる `@QuarkusTest` 関連のクラスを無視するようになっています

source: This config will only work if at least one `@QuarkusTest` is being run. If you are not using `@QuarkusTest` then you can simply use the JaCoCo plugin in the standard manner with no additional config.
ja_jp: この設定は、少なくとも1つの `@QuarkusTest` が実行されている場合にのみ機能します。 `@QuarkusTest` を使用していない場合は、追加の設定をすることなく、通常の方法で Jacoco プラグインを使用することができます。

source: This config will only work if at least one `@QuarkusTest` is being run. If you are not using `@QuarkusTest` then you can simply use the Jacoco plugin in the standard manner with no additional config.
ja_jp: この設定は、少なくとも1つの `@QuarkusTest` が実行されている場合にのみ機能します。 `@QuarkusTest` を使用していない場合は、追加の設定をすることなく、通常の方法で Jacoco プラグインを使用することができます。

source: This configuration adheres to the official https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_filter[Keycloak Policy Enforcer Configuration] guidelines. For detailed insights into various configuration options, see the following documentation:
ja_jp: この設定は、公式の https://www.keycloak.org/docs/latest/authorization_services/index.html#_enforcer_filter[Keycloak Policy Enforcer 設定] ガイドラインに準拠しています。 さまざまな設定オプションの詳細は、次のドキュメントを参照してください。

source: This configuration allows for a simpler API sequence:
ja_jp: この設定により、API シーケンスが簡素化されます。

source: This configuration assumes that PostgreSQL will be running locally.
ja_jp: この設定では、PostgreSQLがローカルで動作していることを前提としています。

source: This configuration can be achieved via the `quarkus.rest-client.multipart-post-encoder-mode` property.
ja_jp: この設定は、 `quarkus.rest-client.multipart-post-encoder-mode` プロパティーを介して実現できます。

source: This configuration can be global (as above), or set in the channel configuration:
ja_jp: この設定は、(上記のように) グローバルにすることも、チャネル設定で設定することもできます。

source: This configuration creates two users: * `duke` with a `dukePassword` password and a `reader` role * `john` with a `johnPassword` password and `reader` and `writer` roles
ja_jp: この設定により、2人のユーザーが作成されます: * `dukePassword` パスワードと `reader` ロールを持つ `duke` * `johnPassword` パスワードと `reader` および `writer` ロールを持つ `john`

source: This configuration enables mTLS by ensuring that both the server and client validate each other's certificates, which provides an additional layer of security.
ja_jp: この設定により、サーバーとクライアントの両方が互いの証明書を検証することで mTLS が有効になり、セキュリティーがさらに強化されます。

source: This configuration enables mTLS by ensuring that both the server and the client validate each other's certificates, which provides an additional layer of security.
ja_jp: この設定により、サーバーとクライアントの両方が互いの証明書を検証することが保証され、セキュリティーのレイヤーが追加されて mTLS が有効になります。

source: This configuration instructs the `protobuf-maven-plugin` to generate the default gRPC classes and classes using Mutiny to fit with the Quarkus development experience.
ja_jp: この設定は、Quarkusの開発経験に合わせてMutinyを使用してデフォルトのgRPCクラスとクラスを生成するように、 `protobuf-maven-plugin` に指示します。

source: This configuration is equivalent to the following:
ja_jp: この構成は以下に相当します。 :
